Вариант 8. Реализуйте рекурсивную функцию для подсчета суммы элементов массива.

Вариант 1: Базовый подход
python
def sum_array(arr):
    """
    Рекурсивная функция для подсчета суммы элементов массива
    
    Args:
        arr: список чисел
    
    Returns:
        int/float: сумма всех элементов массива
    """
    # Базовый случай: пустой массив
    if len(arr) == 0:
        return 0
    # Рекурсивный случай: первый элемент + сумма остальных
    else:
        return arr[0] + sum_array(arr[1:])

# Примеры использования
print(sum_array([1, 2, 3, 4, 5]))      # 15
print(sum_array([10, 20, 30]))         # 60
print(sum_array([5]))                  # 5
print(sum_array([]))                   # 0
Вариант 2: С использованием индексов (более эффективный)
python
def sum_array_index(arr, index=0):
    """
    Рекурсивная функция для подсчета суммы с использованием индексов
    
    Args:
        arr: список чисел
        index: текущий индекс (по умолчанию 0)
    
    Returns:
        int/float: сумма всех элементов массива
    """
    # Базовый случай: дошли до конца массива
    if index >= len(arr):
        return 0
    # Рекурсивный случай: текущий элемент + сумма оставшихся
    else:
        return arr[index] + sum_array_index(arr, index + 1)

# Примеры использования
print(sum_array_index([1, 2, 3, 4, 5]))      # 15
print(sum_array_index([10, 20, 30]))         # 60
Вариант 3: С обработкой различных типов данных
python
def sum_array_advanced(arr):
    """
    Усовершенствованная рекурсивная функция для подсчета суммы
    
    Args:
        arr: список чисел или вложенных списков
    
    Returns:
        int/float: сумма всех числовых элементов
    """
    total = 0
    
    for element in arr:
        if isinstance(element, list):
            # Рекурсивный вызов для вложенного списка
            total += sum_array_advanced(element)
        elif isinstance(element, (int, float)):
            # Числовой элемент - добавляем к сумме
            total += element
        else:
            # Пропускаем нечисловые элементы
            continue
    
    return total

# Примеры использования
print(sum_array_advanced([1, 2, [3, 4], 5]))          # 15
print(sum_array_advanced([1, [2, [3, 4]], 5]))        # 15
print(sum_array_advanced([1, "hello", 3, [4, 5]]))    # 13 (строка игнорируется)
Объяснение работы:
Базовый случай: когда массив пуст, возвращаем 0

Рекурсивный случай: берем первый элемент и прибавляем сумму оставшихся элементов

Рекурсия продолжается до тех пор, пока не достигнет базового случая

Визуализация для массива [1, 2, 3]:
text
sum_array([1, 2, 3])
= 1 + sum_array([2, 3])
= 1 + (2 + sum_array([3]))
= 1 + (2 + (3 + sum_array([])))
= 1 + (2 + (3 + 0))
= 1 + (2 + 3)
= 1 + 5
= 6
Все варианты корректно обрабатывают пустые массивы и массивы с одним элементом.

Контрольные вопросы.
8. Сколько существует перестановок множества из n элементов?
Ответ: n! (n-факториал)

Объяснение:

Перестановка — это все возможные способы упорядочить n элементов.
На первое место можно поставить любой из n элементов.
На второе место — любой из оставшихся (n-1) элементов.
И так далее, пока не кончатся элементы.

Формула:
n × (n-1) × (n-2) × ... × 2 × 1 = n!

Примеры:

3 элемента = 3! = 6 перестановок

5 элементов = 5! = 120 перестановок

0 элементов = 0! = 1 (пустая перестановка)
